import { ScrollView, View } from 'react-native';
import P_12R from '../../style/paragraph/P_12R';
import P_14M from '../../style/paragraph/P_14M';

const PolicyService = () => {
  return (
    <ScrollView
      style={{
        backgroundColor: '#ffffff',
        paddingHorizontal: 24,
      }}
    >
      <View>
        <P_14M style={{ marginBottom: 16 }}>제 1 장 총칙</P_14M>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 1 조 (목적)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            본 약관은 통신닥터(주)(이하 "회사"라 한다.)가 운영하는 애플리케이션
            “통신닥터” (이하 “서비스App”) 이용과 관련하여, 회사와 이용자간의
            권리, 의무 및 책임사항, 서비스 이용 절차 및 필요한 사항을 규정하는
            것을 목적으로 합니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 2 조 (용어의 정의)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            본 약관에서 사용하는 용어의 정의는 다음과 같습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            1. ‘통신닥터(통닥)’ App 서비스란 구글스토어 및 IOS App Store 등을
            통해 배포된 앱으로 회사의 웹사이트 및 연계된 모바일 어플리케이션을
            통해 이용자에게 제공하는 서비스를 통칭하며, 이용자와 이용자가 등록한
            가족의 동의하에 수집하거나 직접 입력한 정보를 확인할 수 있게 하는
            서비스, 이용자와 이용자가 등록한 가족의 통신사 요금청구 정보를
            분석하여 절감방법 등을 제공하는 서비스, 구매시 최적의 휴대폰
            구매조건을 제시하고 구매처를 연계하는 서비스를 말합니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. "회원"이란 서비스App 에 개인정보를 제공하여 회원가입을 완료한
            자로서, 이 약관에 따라 서비스App 에 접속하여 서비스를 계속적으로
            이용할 수 있는 자를 말합니다. {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            3. ”가족회원”이란 회원이 추가 등록하여 “회원”이 정보를 공유하도록
            동의절차를 거친 고객을 말합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            4. ”아이디(ID)”는 회원의 식별과 회원 서비스 이용을 위하여 회원이
            서비스에 직접 등록한 이메일 주소를 말합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            5. “비밀번호(PASSWORD)”란 회원이 등록한 아이디와 일치되는 회원임을
            확인하고 비밀보호를 위해 회원 자신이 정한 문자, 숫자, 특수문자의
            조합을 말합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            6. 통닥 파트너스(판매처 회원)란 회사와의 별도 계약을 통해 회사의
            통신닥터 휴대폰 판매 서비스(모바일, 인터넷, 인터넷전화, IPTV 등)
            대행업을 위수탁하여 판매하는 사업자등록자 上 통신판매업으로 등록한
            대리점 및 판매점이며 회사와 위수탁 판매 서비스이용 계약을 체결한
            자입니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            7. 통닥 주치의(점검 전문가)란 회사와의 별도 계약을 통해 고객의
            통신비 절감분석을 서포트하는 통신관련 전문가로 고객 요청 시 휴대폰
            판매 서비스(모바일, 인터넷, 인터넷전화, IPTV 등)까지를 진행하는
            사업자등록자 上 통신판매업으로 등록한 대리점 및 판매점 또는 그
            소속의 직원이며 회사와 위수탁 판매 서비스이용 계약을 체결한
            자입니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            8. 운영자란 서비스의 전반적인 관리와 원활한 운영을 위하여 회사가
            선정한 자를 말합니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>
            제 3 조 (약관의 효력 및 변경)
          </P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 이 약관은 서비스App 에 게시하거나 기타의 방법으로 회원에게
            공지함으로써 효력이 발생합니다. 모든 서비스는 이용자가 본 약관
            내용에 동의하는 것을 조건으로 제공되는 것이며, 이용자는 본 서비스에
            가입하여 회원이 되었을 때 약관은 그 효력이 발생합니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 이 약관의 내용과 상호, 대표자 성명, 본점 소재지,
            사업자등록번호, 전자우편주소를 이용자가 알 수 있도록 서비스App 에
            게시합니다. 다만, 이 약관의 내용은 연결 화면을 통하여 볼 수 있도록
            할 수 있습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            3. 회사는 관련법(령)을 위배하지 않는 범위에서 이 약관을 개정할 수
            있습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            4. 회사가 약관을 개정하고자 할 때에는 개정사유, 개정내용 및 적용일자
            등을 명시하여 적용일자 7 일 이전부터 서비스App 에 게시하거나 회원의
            전자우편 주소로 통지하여 드립니다. 다만, 법령의 개정이나 제도의 개선
            등으로 긴급히 본 약관을 변경할 경우에는 즉시 이를 게시하고
            통지합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            5. 약관의 개정 내용이 회원에게 불리한 경우, 회사는 회원이 사전에
            제시한 전자우편주소로 변경 전 최소 30 일 전까지 통지합니다. 다만,
            기존 회원에게 변경 전 내용이 그대로 적용되는 경우 또는 회원이
            변경내용에 대한 통지를 받지 아니하겠다는 의사를 명시적으로 표시한
            경우에는 개별통지를 하지 않습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            6. 회사는 전항에 의해 불리한 개정 내용을 통지를 할 경우 "회원이
            변경에 동의하지 아니하는 경우 통지를 받은 날로부터 30 일 이내 또는
            유료서비스 이용기간 종료 시점에 서비스 이용을 종료할 수 있으며,
            변경된 약관 개정 적용일까지 약관 개정에 대한 거부의사를 표시하지
            아니한 경우에는 개정에 동의한 것으로 본다"라는 취지의 내용을
            통지합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            7. 회원이 전항에 따라 명시적 의사표시를 하지 아니한 경우에는 약관
            개정에 동의한 것으로 보며, 개정된 약관의 부지로 인한 회원의 피해는
            회사가 책임지지 아니하며, 개 약관의 효력 발생일 이후에도 계속
            이용하는 경우 약관의 변경사항에 동의한 것으로 간주합니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            8. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는
            관계법령 또는 상관례 및 회사가 서비스App 內 공지한 내용에 따릅니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 4 조 (약관 외 준칙)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 본 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법,
            독점규제 및 공정거래에 관한 법률, 컴퓨터 프로그램 보호법, 저작권법
            등 관계법령 및 회사가 제공하는 서비스에 관한 별도의 약관, 이용규정
            또는 세부이용지침 등의 규정에 따릅니다. 또한 상품의 구매와 관련하여
            본 약관에 명시되지 않은 사항은 전자상거래의 소비자보호에 관한 법률과
            일반 상관례 등 관계법령 및 회사가 제공하는 서비스에 관한 별도의
            약관, 이용규정 또는 세부이용지침 등의 규정에 따릅니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 유료서비스 및 개별 서비스에 대해서는 별도의 이용약관 및
            정책을 둘 수 있으며, 해당 내용이 이 약관과 상충할 경우에는 별도의
            이용약관 및 정책이 우선하여 적용됩니다.
          </P_12R>
        </View>
      </View>
      <View>
        <P_14M style={{ marginBottom: 16 }}>제 2 장 회원가입계약</P_14M>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 5 조 (회원계약의 성립)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사는 본 서비스를 이용하고자 하는 자(이하 ‘이용자’)가 단말기를
            통하여 제시된 본 서비스 이용약관에 '동의함' 버튼을 선택한 뒤 회원
            가입 버튼을 클릭하여 전송하면 약관에 동의하는 것으로 간주합니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회원 가입신청에 대한 회사의 승낙시점은 회원가입이 완료되었다는
            내용이 열린 때, 또는 시스템상으로 로그인(LOG-IN)이 가능해진 시점으로
            봅니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 6 조 (회원가입 신청)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회원가입은 이용자가 회원이 되어 본 서비스를 이용하기 위해
            수행하는 절차로써, 이용자가 본 서비스의 모바일 애플리케이션을 내려
            받은 후 최초 실행 때 제시되는 이용약관에 동의하고 가입 신청 절차를
            수행하는 방식으로 이루어집니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 다음 각호의 1 에 해당하는 경우 가입 신청에 대한 승낙을
            제한할 수 있고, 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
            {'\n'}
            가) 서비스 관련 설비의 용량이 부족한 경우{'\n'}나) 기술상 장애사유가
            있는 경우{'\n'}다) 휴대폰 인증 등 회사가 정한 인증절차를 완료하지
            않은 경우{'\n'}라) 기타 회사가 필요하다고 인정되는 경우
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 7 조 (회원탈퇴)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회원은 회원가입계약을 해지하고자 하는 경우에 탈퇴신청을 할 수
            있으며, 회사는 빠른 시간 내로 탈퇴처리를 할 의무가 있습니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 회원이 제16 조 회원의 의무에 위배되는 행위를 한 경우
            사전통지 없이 회원가입계약을 해지하거나 회원자격을 적절한 방법으로
            제한 및 정지할 수 있습니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>
            제 8 조 (회원자격 해지, 제한, 정지의 절차)
          </P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사는 제7 조 제2 항 규정에 의하여 회원자격을 해지, 제한 또는
            정지하고자 하는 경우에는 그 사유, 일시 및 기간을 정하여 전자우편,
            서면 또는 전화, 문자 메세지 등의 방법에 의하여 해당 회원 또는
            대리인에게 통지합니다. 다만, 회사가 긴급하게 회원의 서비스 이용을
            정지할 필요가 있다고 인정하는 경우에는 그러하지 아니합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 제1 항에 의하여 이용제한의 통지를 받은 회원 또는 그 대리인이
            이용제한 통지에 대하여 이의가 있는 경우에는 이의신청을 할 수
            있습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            3. 회사는 제2 항의 규정에 의한 이의신청에 대하여 그 확인을 위한
            기간까지 이용제한을 일시 연기할 수 있으며, 그 결과를 제1 항 본문의
            통지 방법에 따라 이용자 또는 그 대리인에게 통지합니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            4. 회사는 이용제한기간 중에 그 사유가 해소된 것이 확인된 경우에는
            이용제한 조치를 즉시 해제합니다.
          </P_12R>
        </View>
      </View>
      <View>
        <P_14M style={{ marginBottom: 16 }}>제 3 장 서비스 제공 및 이용</P_14M>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>
            제 9 조 (서비스의 내용 및 변경)
          </P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사는 다음과 같은 서비스를 제공합니다.{'\n'}가) 회원 및 등록한
            가족의 ‘가족 통신비 진단’ 서비스 (통신사 요금청구서 연계)
            {'\n'}나) 통닥 주치의 추가점검 서비스{'\n'}다) 휴대폰 최적구매
            서비스{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 필요한 경우 언제든지 서비스의 내용을 추가 또는 변경할 수
            있습니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 10 조 (서비스의 개시)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 서비스는 회사가 제5 조 제2 항에 따라 이용신청을 승낙한 때로부터
            즉시 개시됩니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 제6 조 제2 항에 따라 업무상 또는 기술상의 장애로 본
            서비스의 제공을 개시하지 못할 때에는 해당 내용을 사이트에 공지하거나
            회원에게 통지합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            3. 본 서비스 내 개별 서비스별 구체적인 안내사항은 개별서비스
            화면에서 확인할 수 있습니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>
            제 11 조 (서비스의 이용시간)
          </P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 서비스는 회사의 업무상 또는 기술상 장애, 기타 특별한 사유가 없는
            한 연중무휴, 1 일 24 시간 이용할 수 있습니다. 다만 설비의 점검 등
            회사가 필요한 경우 또는 설비의 장애, 서비스 이용의 폭주 등 불가항력
            사항으로 인하여 서비스 이용에 지장이 있는 경우 예외적으로 서비스
            이용의 전부 또는 일부에 대하여 제한할 수 있습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 제공하는 서비스 중 일부에 대한 서비스 이용시간을 별도로
            정할 수 있으며, 이 경우 그 이용시간을 사전에 회원에게 공지 또는
            통지합니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>
            제 12 조 (서비스 제공의 중지)
          </P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사는 다음 각 호에 해당하면 본 서비스의 전부 또는 일부를
            제한하거나 중지할 수 있습니다.{'\n'}가) 서비스용 설비의 보수 등을
            위하여 부득이한 경우{'\n'} 나) 전기통신사업법」에 규정된
            기간통신사업자가 전기통신서비스를 중지하는 경우{'\n'}다) 제반설비의
            장애 또는 이용량 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
            {'\n'}라) 본 서비스의 변경 및 중단 등과 같은 특수사정으로 본
            서비스를 유지할 수 없는 경우{'\n'}마) 기타 천재지변, 국가비상사태 등
            불가항력 사유가 있는 경우{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 고의 또는 과실이 없는 한 본 조에 따른 서비스의 변경,
            중지로 발생하는 문제에 대해 어떠한 책임도 지지 않습니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>
            제 13 조 (정보의 제공 및 광고의 게재)
          </P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사는 본 서비스의 운영과 관련한 공지사항을 본 서비스의 홈페이지
            또는 모바일 애플리케이션의 서비스 화면에 게재하거나 문자메시지(SMS),
            이메일(E-MAIL), 스마트푸시(Smart Push)등으로 통지할 수 있습니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 본 서비스의 운영과 관련한 각종 정보와 광고를 본 서비스의
            홈페이지 또는 모바일 애플리케이션의 서비스 화면에 게재하거나 회원의
            동의를 얻어 이메일(E-MAIL), 우편, 단문/장문 문자메시지(SMS/MMS),
            텔레마케팅 (TM) 등의 방법으로 회원에게 제공할 수 있습니다.
          </P_12R>
        </View>
      </View>
      <View>
        <P_14M style={{ marginBottom: 16 }}>
          제 4 장 서비스와 관련한 권리·의무 관계
        </P_14M>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 14 조 (회사의 의무)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사는 제12 조에 정한 경우를 제외하고는 계속적, 안정적으로
            서비스를 제공할 수 있도록 최선의 노력을 다하여야 합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회사는 서비스에 관련된 설비를 항상 운용할 수 있는 상태로
            유지·보수하고, 장애가 발생하는 경우 지체 없이 이를 수리·복구할 수
            있도록 최선의 노력을 다하여야 합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            3. 회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를
            조속히 처리하도록 최선의 노력을 다하여야 합니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 15 조 (개인정보의 보호)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사는 서비스와 관련하여 지득한 회원의 개인정보를 본인의 사전
            승낙 없이 타인에게 누설, 공개 또는 배포할 수 없습니다. 다만, 다음 각
            호의 해당하는 경우에는 그러하지 아니합니다.
            {'\n'}가) 관계법령에 의하여 수사상의 목적으로 관계기관으로부터
            요구받은 경우{'\n'}나) 정보통신윤리위원회 및 방송통신위원회의 요청이
            있는 경우{'\n'}다) 기타 관계법령에 의한 경우{'\n'}라) 특정 개인을
            식별할 수 없는 통계작성, 홍보자료, 학술연구 등의 목적일 때{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 제1 항의 범위 내에서, 회사는 광고업무와 관련하여 이용자 및 회원
            전체 또는 일부의 개인정보에 관한 통계 자료를 작성하여 이를 사용할 수
            있습니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 16 조 (회원의 의무)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회원은 관계법령, 이 약관의 규정, 이용안내 및 주의사항 등 회사가
            통지하는 사항을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를
            하여서는 아니 됩니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회원은 회사의 사전 승낙 없이 서비스를 이용하여 어떠한 영리행위도
            할 수 없습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            3. 회원은 서비스를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복사,
            복제, 변경, 번역, 출판·방송 기타의 방법으로 사용하거나 이를 타인에게
            제공할 수 없습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            4. 회원은 서비스이용과 관련하여 다음 각 호의 행위를 하여서는 아니
            됩니다.{'\n'}가) 다른 회원의 아이디(ID)를 부정적인 목적에 사용하는
            행위{'\n'}나) 범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위
            {'\n'}다) 선량한 풍속, 기타 사회질서를 해하는 행위{'\n'}라) 타인의
            명예를 훼손하거나 모욕하는 행위
            {'\n'}마) 타인의 지적재산권 등의 권리를 침해하는 행위{'\n'}바)
            해킹행위 또는 컴퓨터바이러스의 유포행위{'\n'}사) 타인의 의사에
            반하여 광고성 정보 등 일정한 내용을 지속적으로 전송하는 행위
            {'\n'}아) 서비스의 안정적인 운영에 지장을 주거나 줄 우려가 있는
            일체의 행위{'\n'}자) 기타 관계법령에 위배되는 행위{'\n'}
            차) 기타 회사가 부적절하다고 판단하는 행위
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>
            제 17 조 (회원의 ID 및 휴대폰번호 인증에 대한 의무)
          </P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회원은 서비스를 이용하는 경우 본인의 ID 및 휴대폰번호 인증을 해야
            합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. ID 및 휴대폰번호 인증에 대한 모든 관리의 책임은 회원에게
            있습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            3. 회원은 ID 및 휴대폰번호 인증을 제3 자에게 이용하게 하여서는 아니
            됩니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            4. ID 및 휴대폰번호 인증 관리상의 불충분, 사용상의 과실, 제3 자의
            사용 등에 의한 손해의 책임은 회원이 집니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            5. 회원은 ID 를 도난당하거나 제3 자에게 사용되고 있음을 인지한
            경우에는 바로 회사에 통보하고 회사의 지시가 있는 경우에는 그에
            따라야 합니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>
            제 18 조 (게시물 또는 내용물의 삭제)
          </P_14M>
          <P_12R style={{ color: '#666666' }}>
            회사는 서비스의 게시물 또는 내용물이 다음 각호의 해당한다고 판단되는
            경우 회원에게 사전통지나 동의 없이 이를 삭제할 수 있습니다.{'\n'}
            가) 회원이 제16 조 회원의 의무에 위배되는 행위를 한 경우{'\n'}
            나) 회사 소정의 게시기간을 초과하는 경우{'\n'}다) 게시판의 성격에
            부합되지 않는 게시물인 경우
          </P_12R>
        </View>
      </View>
      <View>
        <P_14M style={{ marginBottom: 16 }}>제 5 장 기타</P_14M>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 19 조 (저작권의 귀속)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사가 작성한 서비스에 관한 저작권 및 기타 지적재산권은 회사에
            귀속됩니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회원이 작성한 게시물에 대한 모든 권리 및 책임은 게시한 회원에게
            있습니다. 다만, 회원이 회사에 제공한 공개적인 게시물은 회사에게 동
            게시물을 전부 또는 일부를 사용, 복제, 수정, 개조, 출판, 번역,
            창작물을 제작하거나 배포, 실행 또는 전시할 수 있는 권리 및 사용권을
            부여한 것으로 봅니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 20 조 (양도금지)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            회원은 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도,
            증여할 수 없으며, 이를 담보로 제공할 수 없습니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 21 조 (손해배상)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            회사가 제공하는 서비스와 관련하여 회원에게 어떠한 손해가
            발생하더라도 동 손해가 회사의 중대한 과실에 의한 경우를 제외하고는
            회사는 이에 대하여 책임을 부담하지 않습니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 22 조 (면책)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사는 회원의 귀책사유로 인한 서비스이용의 장애에 대하여 책임을
            지지 않습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 회원의 아이디(ID)와 휴대폰번호 인증 관리와 관련하여 당해 회원의
            귀책사유에 의한 손해 또는 제3 자에 의한 부정사용 등에 대한 책임은
            모두 회원에게 있습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            3. 회원이 등록한 가족회원과 관련하여 가족 또는 가족에 준하는지의
            여부에 대한 책임은 회원 본인에게 있습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            4. 회원 및 가족회원이 ‘통신사 요금청구서’를 회사와 연계함에 있어
            발생하는 모든 문제와 관련하여 회사는 책임을 지지 않습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            5. 회사는 회원이 서비스에 게재한 정보, 자료, 사실의 정확성, 신뢰성
            등 그 내용에 관하여는 어떠한 책임도 부담하지 아니합니다.
            {'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            6. 회사가 제공하는 정보와 자료는 거래의 목적으로 이용될 수 없습니다.
            따라서 본 서비스의 정보와 자료 등에 근거한 거래는 전적으로
            회원자신의 책임과 판단아래 수행되는 것이며 회사는 이에 대하여 책임을
            부담하지 않습니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            7. 회원이 제16 조, 기타 이 약관의 규정을 위반함으로 인하여 회사가
            회원 또는 제3 자에 대하여 책임을 부담하게 되고, 이로써 회사에게
            손해가 발생되는 경우 이 약관을 위반한 당해 회원은 회사에게 발생하는
            모든 손해를 배상하여야 하며, 동 손해로부터 회사를 면책시켜야 합니다.
          </P_12R>
        </View>
        <View style={{ marginBottom: 16 }}>
          <P_14M style={{ marginBottom: 8 }}>제 23 조 (분쟁의 해결)</P_14M>
          <P_12R style={{ color: '#666666' }}>
            1. 회사와 회원은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기
            위하여 필요한 모든 노력을 하여야 합니다.{'\n'}
          </P_12R>
          <P_12R style={{ color: '#666666' }}>
            2. 제1 항의 규정에도 불구하고, 동 분쟁으로 인하여 소송이 제기될 경우
            동 소송은 회사의 본사소재지를 관할하는 법원의 관할로 합니다.
          </P_12R>
        </View>
      </View>
      <View
        style={{
          alignItems: 'flex-end',
          paddingBottom: 40,
        }}
      >
        <P_14M>- 공고일자 : 2021 년 10 월 28 일</P_14M>
        <P_14M>- 적용일자 : 2021 년 11 월 01 일</P_14M>
      </View>
    </ScrollView>
  );
};

export default PolicyService;
